In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame()

In [5]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
df1 = pd.DataFrame([[1,2,3,4], [5,6,7,8],[3,6,8,23],[23,23,63,12]])

In [8]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   3   6   8  23
3  23  23  63  12

In [9]:
df1.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [10]:
df1.tail(2)

    0   1   2   3
2   3   6   8  23
3  23  23  63  12